<?php

return [
    'otp_sent' => 'OTP отправлен',
    'otp_verified' => 'OTP подтверждён',
    'logged_out' => 'Выход выполнен',
    'invalid_credentials' => 'Неверный логин или пароль.',
    'invalid_or_expired_otp' => 'Неверный или просроченный OTP.',
    'school_registration_pending' => 'Заявка на регистрацию школы отправлена. Ожидается подтверждение администратора.',
    'registered' => 'Регистрация прошла успешно.',
    'logged_in' => 'Вход выполнен успешно.',
    'registration_pending' => 'Регистрация отправлена. Ваша учетная запись ожидает подтверждения администратором.',
    'account_pending' => 'Ваша учетная запись ожидает подтверждения. Пожалуйста, дождитесь подтверждения администратором.',
    'account_approved' => 'Пользователь подтвержден.',
];
